nc: 10  # Number of classes
task: classify
stride: 1
backbone:
  # [from, repeats, module, args]
  - [-1, 1, nn.Conv2d, [3, 1, 1]]
  - [-1, 1, nn.Conv2d, [1, 6, 5]]
  - [-1, 1, nn.BatchNorm2d, [6]]
  - [-1, 1, nn.ReLU, []]
  - [-1, 1, nn.MaxPool2d, [2, 2]]
  - [-1, 1, nn.Conv2d, [6, 16, 5]]
  - [-1, 1, nn.BatchNorm2d, [16]]
  - [-1, 1, nn.ReLU, []]
  - [-1, 1, nn.MaxPool2d, [2, 2]]
head:
  - [-1, 1, nn.Flatten, []]
  - [-1, 1, nn.Linear, [400, 120]]
  - [-1, 1, nn.ReLU, []]
  - [-1, 1, nn.Linear, [120, 84]]
  - [-1, 1, nn.ReLU, []]
  - [-1, 1, nn.Linear, [84, 10]]
